UB_Copy/src/DataProcessors/УБ_СравнениеВерсийГрейда/УБ_СравнениеВерсийГрейда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УБ_СравнениеВерсийГрейда</name>
</mdclass:DataProcessor>

UB_Copy/src/InformationRegisters/УБ_ВерсииГрейдов/УБ_ВерсииГрейдов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ВерсииГрейдов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодРасчетаМоделиПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </resources>
  <resources>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.УБ_СтатусыМоделейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплатыПриБезокладнойСистеме</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <dimensions>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Enums/УБ_СтатусыМоделейПланирования/УБ_СтатусыМоделейПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_СтатусыМоделейПланирования</name>
  <enumValues>
    <name>Планируется</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Неактуальный</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Documents/УБ_УтверждениеГрейда/УБ_УтверждениеГрейда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_УтверждениеГрейда</name>
  <basedOn>Document.УБ_УтверждениеГрейда</basedOn>
  <registerRecords>InformationRegister.УБ_УстановленныеШкалыПоказателей</registerRecords>
  <registerRecords>InformationRegister.УБ_РасценкиПоказателейЭффективности</registerRecords>
  <registerRecords>InformationRegister.УБ_ФормулыПоказателейЭффективности</registerRecords>
  <registerRecords>InformationRegister.УБ_ВерсииГрейдов</registerRecords>
  <registerRecords>InformationRegister.УБ_СоставСтандартовМоделейПланирования</registerRecords>
  <registerRecords>InformationRegister.УБ_СоставПоказателейМоделейПланирования</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплатыПриБезокладнойСистеме</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.УБ_СтатусыМоделейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаМоделиПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Матричный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателей</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаИзменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасценки</name>
      <type>
        <types>EnumRef.УБ_ВидыРасценокПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьРезультатОтФакта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Фиксированный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НегативноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозитивноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьРасчета</name>
      <type>
        <types>EnumRef.УБ_ПериодичностьРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничиватьМинимальноеЗначениеРезультата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничиватьМаксимальноеЗначениеРезультата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормулыРасчета</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыПоказателей</name>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыИспользованияПоказателей</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/DataProcessors/УБ_СравнениеВерсийГрейда/Forms/ОтчетПоВерсиямГрейда/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрКоманды = Неопределено;
	Если Параметры.Свойство("ПараметрКоманды", ПараметрКоманды)
		И ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.УБ_УтверждениеГрейда") Тогда
		ПараметрыУтвержденияГрейда = ПараметрыУтвержденияГрейда(ПараметрКоманды);
		МодельПланированияЭффективности = ПараметрыУтвержденияГрейда.МодельПланированияЭффективности;
		Грейд = ПараметрыУтвержденияГрейда.Грейд;
		ПерваяВерсияГрейда = ПараметрыУтвержденияГрейда.ПерваяВерсияГрейда;
		ВтораяВерсияГрейда = ПараметрыУтвержденияГрейда.ВтораяВерсияГрейда;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МодельПланированияЭффективности) Тогда
		МодельПланированияЭффективности = Параметры.МодельПланированияЭффективности;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Грейд) Тогда
		Грейд = Параметры.Грейд;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПерваяВерсияГрейда) Тогда
		ПерваяВерсияГрейда = Параметры.ПерваяВерсияГрейда;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВтораяВерсияГрейда) Тогда
		ВтораяВерсияГрейда = Параметры.ВтораяВерсияГрейда;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(МодельПланированияЭффективности)
		И ЗначениеЗаполнено(Грейд)
		И ЗначениеЗаполнено(ПерваяВерсияГрейда)
		И ЗначениеЗаполнено(ВтораяВерсияГрейда) Тогда
		
		СформироватьОтчетПоВерсиям();
		
	Иначе
		ТребуетсяОбновитьДанныеОтчета();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(МодельПланированияЭффективности) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Модель планирования эффективности"" не заполнено'"), ,
			"МодельПланированияЭффективности", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Грейд) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Грейд"" не заполнено'"), ,
			"Грейд", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПерваяВерсияГрейда) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Версия №1"" не заполнено'"), ,
			"ПерваяВерсияГрейда", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВтораяВерсияГрейда) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Версия №2"" не заполнено'"), ,
			"ВтораяВерсияГрейда", ,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельПланированияЭффективностиПриИзменении(Элемент)
	
	ПерваяВерсияГрейда = Неопределено;
	ВтораяВерсияГрейда = Неопределено;
	
	ТребуетсяОбновитьДанныеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрейдПриИзменении(Элемент)
	
	ТребуетсяОбновитьДанныеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерваяВерсияГрейдаПриИзменении(Элемент)
	
	ТребуетсяОбновитьДанныеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ВтораяВерсияГрейдаПриИзменении(Элемент)
	
	ТребуетсяОбновитьДанныеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоОтличияПриИзменении(Элемент)
	
	ТребуетсяОбновитьДанныеОтчета();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетПоВерсиям();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТребуетсяОбновитьДанныеОтчета()
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТаблицаОтчета, "Неактуальность");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоВерсиям()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТаблицаОтчета, "ФормированиеОтчета");
	ПодключитьОбработчикОжидания("НачатьФормированиеОтчетаПоВерсиям", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьФормированиеОтчетаПоВерсиям()
	ДлительнаяОперация = СформироватьОтчетПоВерсиямНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииФормированияОтчета", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания); 
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетПоВерсиямНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор());
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("МодельПланированияЭффективности", МодельПланированияЭффективности);
	ПараметрыОтчета.Вставить("Грейд", Грейд);
	ПараметрыОтчета.Вставить("ПоказыватьТолькоОтличия", ПоказыватьТолькоОтличия);
	ПараметрыОтчета.Вставить("ПерваяВерсияГрейда", ПерваяВерсияГрейда);
	ПараметрыОтчета.Вставить("ВтораяВерсияГрейда", ВтораяВерсияГрейда);
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.УБ_СравнениеВерсийГрейда.СформироватьОтчетПоВерсиямГрейда",
		ПараметрыОтчета, ПараметрыВыполнения);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФормированияОтчета(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТаблицаОтчета, "НеИспользовать");
	Если Результат.Статус = "Выполнено" Тогда
		ТаблицаОтчета = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Иначе
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыУтвержденияГрейда(УтверждениеГрейда)
	
	Параметры = Новый Структура;
	Параметры.Вставить("МодельПланированияЭффективности");
	Параметры.Вставить("Грейд");
	Параметры.Вставить("ПерваяВерсияГрейда");
	Параметры.Вставить("ВтораяВерсияГрейда");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДокумента.МодельПланированияЭффективности КАК МодельПланированияЭффективности,
		|	РеквизитыДокумента.Грейд КАК Грейд,
		|	РеквизитыДокумента.ВерсияГрейда КАК ВерсияГрейда
		|ПОМЕСТИТЬ ВТ_РеквизитыДокумента
		|ИЗ
		|	Документ.УБ_УтверждениеГрейда КАК РеквизитыДокумента
		|ГДЕ
		|	РеквизитыДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяВерсияГрейда.МодельПланированияЭффективности КАК МодельПланированияЭффективности,
		|	ТекущаяВерсияГрейда.Грейд КАК Грейд,
		|	ТекущаяВерсияГрейда.ВерсияГрейда КАК ПерваяВерсияГрейда,
		|	НЕОПРЕДЕЛЕНО КАК ВтораяВерсияГрейда
		|ИЗ
		|	ВТ_РеквизитыДокумента КАК ТекущаяВерсияГрейда
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредыдущаяВерсияГрейда.МодельПланированияЭффективности,
		|	ПредыдущаяВерсияГрейда.Грейд,
		|	НЕОПРЕДЕЛЕНО,
		|	ПредыдущаяВерсияГрейда.ВерсияГрейда
		|ИЗ
		|	РегистрСведений.УБ_ВерсииГрейдов.СрезПоследних(
		|			&ГраницаВерсии,
		|			(МодельПланированияЭффективности, Грейд, Статус) В
		|				(ВЫБРАТЬ
		|					РеквизитыДокумента.МодельПланированияЭффективности,
		|					РеквизитыДокумента.Грейд,
		|					ЗНАЧЕНИЕ(Перечисление.УБ_СтатусыМоделейПланирования.Действует)
		|				ИЗ
		|					ВТ_РеквизитыДокумента КАК РеквизитыДокумента)) КАК ПредыдущаяВерсияГрейда";
	
	Запрос.УстановитьПараметр("Ссылка", УтверждениеГрейда);
	Запрос.УстановитьПараметр("ГраницаВерсии", Новый Граница(УтверждениеГрейда.ДатаУтверждения, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Параметры.МодельПланированияЭффективности) Тогда
				Параметры.МодельПланированияЭффективности = Выборка.МодельПланированияЭффективности;
				Параметры.Грейд = Выборка.Грейд;
			КонецЕсли;
			
			Если Выборка.ПерваяВерсияГрейда <> Неопределено Тогда
				Параметры.ПерваяВерсияГрейда = Выборка.ПерваяВерсияГрейда;
			КонецЕсли;
			
			Если Выборка.ВтораяВерсияГрейда <> Неопределено Тогда
				Параметры.ВтораяВерсияГрейда = Выборка.ВтораяВерсияГрейда;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
